import java.util.Scanner; // Імпорт класу Scanner зі стандартної бібліотеки Java для зчитування вводу з консолі.

public class Main { // Оголошення класу Main та його методу main, який є точкою входу в програму.
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in); // Створення об'єкта Scanner для зчитування вводу з консолі.
        System.out.println("Введення даних: ");

        int max = Integer.MIN_VALUE; // Ініціалізація змінної max найменшим можливим значенням для int.

        while (true) { // Безкінечний цикл для прийому чисел з консолі.
            int num = scanner.nextInt(); // Зчитування числа з консолі.

            if (num == 0) { // Перевірка, чи введене число є нульовим.
                break; // Вихід з циклу, якщо введене число є нульовим.
            }

            if (num > max) { // Перевірка, чи введене число більше поточного максимального числа.
                max = num; // Оновлення значення максимального числа, якщо введене число більше.
            }
        }

        System.out.println("Максимальне число: " + max); // Виведення максимального числа на екран.
    }
}