import java.util.Scanner; //Імпорт класу Scanner зі стандартної бібліотеки Java для зчитування вводу з консолі.

public class Main { //Оголошення класу Main та його методу main, який є точкою входу в програму.
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in); //Створення об'єкта Scanner для зчитування вводу з консолі.
        System.out.println("Введіть кількість незнайомців:"); // Виведення на екран запрошення для введення кількості незнайомців.
        int count = scanner.nextInt(); //Зчитування кількості незнайомців з консолі та збереження її у змінній count.
        scanner.nextLine(); //Виклик методу nextLine(), щоб зчитати рядок, який залишився в буфері після введення кількості незнайомців.

        if (count <= 0) { //Перевірка, чи введена кількість незнайомців більше нуля.
            System.out.println("Кількість незнайомців повинна бути більшою за 0");
            return;
        }

        for (int i = 0; i < count; i++) { //Цикл, який пробігається від 0 до введеної кількості незнайомців.
            System.out.println("Введіть ім'я незнайомця:"); //Запит імені незнайомця.
            String name = scanner.nextLine(); //Зчитування імені незнайомця та збереження його у змінній name.
            System.out.println("Hello, " + name); //Виведення на екран привітання з ім'ям незнайомця.
        }
    }
}