import java.util.Scanner; //Імпорт класу Scanner зі стандартної бібліотеки Java для зчитування вводу з консолі.

public class Main { //Оголошення класу Main та його методу main, який є точкою входу в програму.
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in); //Створення об'єкта Scanner для зчитування вводу з консолі.
        System.out.println("Введіть кількість футів, на які равлик піднімається за день:"); //Виведення на екран запрошення
        int a = scanner.nextInt();
        System.out.println("Введіть кількість футів, на які равлик сповзає вниз за ніч:"); //Виведення на екран запрошення
        int b = scanner.nextInt();
        System.out.println("Введіть висоту дерева в футах:"); //Виведення на екран запрошення
        int h = scanner.nextInt();

        if (a <= b) { //Перевірка, чи равлик може піднятися на висоту дерева. Якщо кількість футів, на які равлик піднімається за день, менше або дорівнює кількості футів, на які равлик сповзає вниз за ніч, виводиться повідомлення "Impossible". У протилежному випадку, обчислюється кількість днів, потрібних для підняття на висоту дерева, та виводиться ця кількість днів.
            System.out.println("Impossible");
        } else {
            int days = (h - b - 1) / (a - b) + 1;
            System.out.println(days);
        }
    }
}