import java.util.Scanner; // Імпортуємо клас Scanner для зчитування введення з консолі.

public class Main { // Початок оголошення класу Main.
    public static void main(String[] args) { // Початок оголошення методу main, який є точкою входу в програму.
        int[] array = {1, 2, 3, 4, 5}; // Ініціалізуємо масив з числами.
        int max = max(array); // Викликаємо метод max для пошуку найбільшого числа в масиві.
        System.out.println("Максимальне значення: " + max); // Виводимо знайдене максимальне значення.
    } // Кінець оголошення методу main.

    public static int max(int[] array) { // Початок оголошення методу max, який знаходить найбільше число в масиві.
        int max = array[0]; // Початкове припущення, що перший елемент є найбільшим.
        for (int i = 1; i < array.length; i++) { // Цикл для перевірки кожного елемента масиву.
            if (array[i] > max) { // Порівнюємо поточний елемент з максимальним.
                max = array[i]; // Якщо поточний елемент більший, оновлюємо максимальне значення.
            }
        }
        return max; // Повертаємо знайдене максимальне значення.
    } // Кінець оголошення методу max.
} // Кінець оголошення класу Main.